yenchouRJ/nuc990_non-os/Library/StdDriver/src/emac.c
/**************************************************************************//**
 * @file     emac.c
 * @brief    EMAC driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2026 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

#include "NuMicro.h"
#include "sys.h"
#include "emac.h"

EMACdevice EMACdev[EMAC_CNT];
static EnhDesc rx_desc[EMAC_CNT][RX_DESC_SIZE] __attribute__ ((aligned(32)));
static EnhDesc tx_desc[EMAC_CNT][TX_DESC_SIZE] __attribute__ ((aligned(32)));

static struct sk_buff rx_buf[EMAC_CNT][RX_DESC_SIZE] __attribute__ ((aligned(8)));
static struct sk_buff tx_buf[EMAC_CNT][TX_DESC_SIZE] __attribute__ ((aligned(8)));

u8 mac_addr0[6] = DEFAULT_MAC0_ADDRESS;
u8 mac_addr1[6] = DEFAULT_MAC1_ADDRESS;

EMACconfig defconfig = {
    .reg.all = 0,
    .reg.bits.ecmp = 1,
    .reg.bits.bcst = 1,
    .reg.bits.mcst = 1,
    .reg.bits.ucst = 1,
    .reg.bits.coe = 1,
    .reg.bits.ts = 1,
    .reg.bits.wol = 1,
    .desc.all = 0,
    .desc.bits.cie = TTIOEN_HP,
    .desc.bits.crcapp = 1,
    .desc.bits.paden = 1,
    .rxcb = NULL,
};

static void init_tx_desc_ring(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];

    emacdev->TxDescCount = TX_DESC_SIZE;
    emacdev->TxDesc = &tx_desc[intf][0];
    emacdev->TxDescDma = (EnhDesc *)((u32)emacdev->TxDesc | NON_CACHE);

    for(int i = 0; i < TX_DESC_SIZE; i++)
    {
        tx_desc[intf][i].status = 0;
        tx_desc[intf][i].buffer = (u32)((&tx_buf[intf][i])->data) | NON_CACHE; // or fill at transmit
        tx_desc[intf][i].extstatus = 0;
        tx_desc[intf][i].next = (u32)&tx_desc[intf][(i + 1) % TX_DESC_SIZE] | NON_CACHE;
    }

    emacdev->TxNext = 0;
    emacdev->TxBusy = 0;
    emacdev->TxNextDesc = emacdev->TxDesc;
    emacdev->TxBusyDesc = emacdev->TxDesc;
    emacdev->BusyTxDesc = 0;

    emacdev->Base->TXDLSA = (u32)emacdev->TxDescDma;
#if defined(FOR_EMULATION)
    if(emacdev->configs.reg.bits.dtxdlsa)
        emacdev->Base->TXDLSA = RDM_INVALID_ADDR;
#endif
}

static void init_rx_desc_ring(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];

    emacdev->RxDescCount = RX_DESC_SIZE;
    emacdev->RxDesc = &rx_desc[intf][0];
    emacdev->RxDescDma = (EnhDesc *)((u32)emacdev->RxDesc | NON_CACHE);

    for(int i = 0; i < RX_DESC_SIZE; i++)
    {
        rx_desc[intf][i].status = (u32)DescRxOwner;
#if defined(FOR_EMULATION)
        if(emacdev->configs.reg.bits.drxdesc)
            rx_desc[intf][i].status = 0;
#endif
        rx_desc[intf][i].buffer = (u32)((&rx_buf[intf][i])->data) | NON_CACHE;
        rx_desc[intf][i].extstatus = 0;
        rx_desc[intf][i].next = (u32)&rx_desc[intf][(i + 1) % RX_DESC_SIZE] | NON_CACHE;
        if(emacdev->configs.reg.bits.ts)
        {
            rx_desc[intf][i].tsmsb = 0;
            rx_desc[intf][i].tslsb = 0;
        }
    }

    emacdev->RxNext = 0;
    emacdev->RxBusy = 0;
    emacdev->RxNextDesc = emacdev->RxDesc;
    emacdev->RxBusyDesc = emacdev->RxDesc;
    emacdev->BusyRxDesc = 0;

    emacdev->Base->RXDLSA = (u32)emacdev->RxDescDma;
#if defined(FOR_EMULATION)
    if(emacdev->configs.reg.bits.drxdlsa)
        emacdev->Base->RXDLSA = RDM_INVALID_ADDR;
#endif
}

void rx_desc_attribute_all(enum EMACINTF intf, u32 owner)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EnhDesc *desc;

    for(int i = 0; i < emacdev->RxDescCount; i++)
    {
        desc = (EnhDesc *)((u32)&rx_desc[intf][i] | NON_CACHE);
        if(owner)
            desc->status |= (u32)DescRxOwner;
        else
            desc->status &= ~(u32)DescRxOwner;
    }
}

struct sk_buff *tx_buf_get(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];

    if(emacdev->TxNextDesc->status & (u32)DescTxOwner)
        return NULL;

    return (struct sk_buff *)((u32)&tx_buf[intf][emacdev->TxNext] | NON_CACHE);
}

static void desc_cleanup(EnhDesc *desc)
{
    desc->status = 0;
    desc->extstatus = 0;
    desc->ptpstatus = 0;
}

static int tx_desc_prepare(enum EMACINTF intf, struct sk_buff *skb)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EnhDesc *desc = (EnhDesc *)((u32)emacdev->TxNextDesc | NON_CACHE);
    u32 next = emacdev->TxNext;
    u32 status;

    if(desc->status & (u32)DescTxOwner)
        return ERR_DESC_NOMEM; // no free descriptor

    emacdev->BusyTxDesc++;

    status = TXDESC_DEFAULT | (skb->len & DescTxTBC);
    if(emacdev->configs.desc.bits.cie)
        status |= emacdev->configs.desc.bits.cie << DescTxTTIOENpos;
    if(emacdev->configs.desc.bits.crcapp)
        status |= DescTxCRCAPP;
    if(emacdev->configs.desc.bits.paden)
        status |= DescTxPADEN;
    if(emacdev->configs.reg.bits.ts)
        status |= DescTxTTSEN;

    desc->status |= (u32)DescTxOwner | status;

    emacdev->TxNextDesc = (EnhDesc *)desc->next;
    emacdev->TxNext = (next + 1) % emacdev->TxDescCount;

    return next;
}

static int tx_desc_retrieve(enum EMACINTF intf, u16 *len, u32 *status, u32 *extstatus)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EnhDesc *desc = (EnhDesc *)((u32)emacdev->TxBusyDesc | NON_CACHE);
    u32 txdone = emacdev->TxBusy;
    struct sk_buff *skb = &tx_buf[intf][txdone];

    if(desc->status & (u32)DescTxOwner)
        return ERR_DESC_BUSY; // owned by DMA
    if(!(desc->status & DescTxTBC))
        return ERR_DESC_ACCES; // no data is transmitted

    emacdev->BusyTxDesc--;

    *status = desc->status;
    *extstatus = desc->extstatus;
    *len = *status & DescTxTBC;

    emacdev->TxBusyDesc = (EnhDesc *)desc->next;
    emacdev->TxBusy = (txdone + 1) % emacdev->TxDescCount;

    if(*status & DescTxTTSEN)
    {
        if(*extstatus & DescTxTTSAS)
        {
            // save ts of tx packet from desc
            skb->ts = (u64)desc->tsmsb * SEC_TO_NSEC + (u64)desc->tslsb;
            skb->ts_ready = 1;
            emacdev->tx_ts.tv_sec = desc->tsmsb;
            emacdev->tx_ts.tv_nsec = desc->tslsb;
        }
        // else
        //     return ERR_DESC_PERM; // desc[7:4] unavailable
    }
    desc_cleanup(desc);

