yenchouRJ/nuc990_non-os/Library/StdDriver/src/emac.c
    return 0;
}

static int rx_desc_read(enum EMACINTF intf, struct sk_buff *skb, u32 *status, u32 *ptptype)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EnhDesc *desc = (EnhDesc *)((u32)emacdev->RxBusyDesc | NON_CACHE);
    u32 next = emacdev->RxBusy;

    if(desc->status & (u32)DescRxOwner)
        return ERR_DESC_BUSY; // owned by DMA

    *status = desc->status;
    if(emacdev->configs.reg.bits.coe)
    {
        skb->ipver = (*status & DescRxIPVMASK) >> DescRxIPVpos;
        skb->protocol = (*status & DescRxPROTMASK) >> DescRxPROTpos;
    }

    skb->pData = (void *)desc->buffer;
    skb->len = *status & DescRxRBC;

    emacdev->RxBusyDesc = (EnhDesc *)desc->next;
    emacdev->RxBusy = (next + 1) % emacdev->RxDescCount;

    if(emacdev->configs.reg.bits.ts)
    {
        if(*status & DescRxRTSAS)
        {
            skb->ts = (u64)desc->tsmsb * SEC_TO_NSEC + (u64)desc->tslsb;
            *ptptype = desc->ptpstatus;
            skb->ptpver = *ptptype & DescRxPTPV;
            skb->ptptype = *ptptype & DescRxPTPFT;
            skb->ptpmesg = *ptptype & DescRxPTPMGT;
            emacdev->rx_ts.tv_sec = desc->tsmsb;
            emacdev->rx_ts.tv_nsec = desc->tslsb;
        }
        // else
        //     return ERR_DESC_PERM; // desc[7:4] unavailable
    }
    desc_cleanup(desc);

    // give ownership back to DMA
    desc->status |= (u32)DescRxOwner;

    return 0;
}

EnhDesc *rx_desc_current(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    return (EnhDesc *)((u32)emacdev->Base->CRXDSA | NON_CACHE);
}

int emac_transmit_frames(enum EMACINTF intf, void *data, u16 len)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    struct sk_buff *skb;

    skb = tx_buf_get(intf);

    if(skb == NULL)
        return ERR_EMAC_NOMEM;

    skb->len = len;
    memcpy(skb->data, data, skb->len);

    tx_desc_prepare(intf, skb);

    // ready to tx
    emac->MCMDR |= MCMDR_TXON;
    emac->TSDR = 0;

    return 0;
}

static inline void txdesc_handle(enum EMACINTF intf, EnhDesc *desc_cur)
{
    EMACdevice *emacdev = &EMACdev[intf];
    u16 len;
    u32 status, extstatus;
    int ret;

    if(!desc_cur)
        return;

    do {
        ret = tx_desc_retrieve(intf, &len, &status, &extstatus);
        if(ret < 0)
            break;

        if(extstatus & (u32)DescTxCCNT)
            emacdev->tx_stat.ccnt += (extstatus & (u32)DescTxCCNT) >> DescTxCCNTpos;
        if(extstatus & DescTxPAU)
            emacdev->tx_stat.pau++;
        if(extstatus & DescTxTXHA)
            emacdev->tx_stat.txha++;
        if(extstatus & DescTxLC)
            emacdev->tx_stat.lc_rd++;
        if(extstatus & DescTxTXABT)
            emacdev->tx_stat.txabt_rd++;
        if(extstatus & DescTxNCS)
            emacdev->tx_stat.ncs_rd++;
        if(extstatus & DescTxTXCP)
            emacdev->tx_stat.txcp_rd++;
        if(extstatus & DescTxTXINTR)
            emacdev->tx_stat.txintr_rd++;

        emacdev->tx_stat.txbytes += len;
        emacdev->tx_stat.txpkts++;
    } while(desc_cur != emacdev->TxBusyDesc);
    emacdev->tx_stat.txcomplete = 1;
}

void emac_tx_handler(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    EnhDesc *desc_cur;
    u32 isr;

    isr = emac->MISTA & MISTA_TX_MASK;
    emac->MISTA = isr;
    desc_cur = (EnhDesc *)emac->CTXDSA;

    if(emacdev->configs.reg.bits.ts && (isr & MISTA_TSALS))
        emacdev->ts_alarm_flag = 1;
    if(isr & MISTA_TXBERR)
    {
        // need sw reset
        emacdev->tx_stat.txberr++;
    }
    if(isr & MISTA_TDU)
        emacdev->tx_stat.tdu++;
    if(isr & MISTA_TXEMP)
        emacdev->tx_stat.txemp++;
    if(isr & MISTA_TXCP)
        txdesc_handle(intf, desc_cur);
}

static inline void rxdesc_handle(enum EMACINTF intf, EnhDesc *desc_cur)
{
    EMACdevice *emacdev = &EMACdev[intf];
    struct sk_buff *skb;
    u32 status, ptptype;
    int ret;

    if(!desc_cur)
        return;

    do {
        skb = &rx_buf[intf][emacdev->RxBusy];
        ret = rx_desc_read(intf, skb, &status, &ptptype);
        if(ret < 0)
            break;
        
        if(emacdev->configs.reg.bits.coe)
        {
            if(status & DescRxIPHE)
                emacdev->rx_stat.iphe++;
            if(status & DescRxIPPE)
                emacdev->rx_stat.ippe++;
        }
        if(status & DescRxRP)
            emacdev->rx_stat.rp_d++;
        if(status & DescRxALIE)
            emacdev->rx_stat.alie_rd++;
        if(status & DescRxRXGD)
            emacdev->rx_stat.rxgd_rd++;
        if(status & DescRxPTLE)
            emacdev->rx_stat.ptle_d++;
        if(status & DescRxCRCE)
            emacdev->rx_stat.crce_d++;
        if(status & DescRxRXINTR)
            emacdev->rx_stat.rxintr_rd++;
        // maybe enqueue skb pointer for higher layer
        if(emacdev->configs.rxcb)
            emacdev->configs.rxcb(intf, skb);
    } while(desc_cur != emacdev->RxBusyDesc);
}

void emac_rx_handler(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    EnhDesc *desc_cur;
    u32 isr;

    isr = emac->MISTA & MISTA_RX_MASK;
    emac->MISTA = isr;
    desc_cur = (EnhDesc *)emac->CRXDSA;

    if(emacdev->configs.reg.bits.wol && (isr & MISTA_MGPR))
        emacdev->wol_flag = 1;
    if(isr & MISTA_CFR)
        emacdev->rx_stat.cfr++;
    if(isr & MISTA_RXBERR)
    {
        // need sw reset
        emacdev->rx_stat.rxberr++;
    }
    if(isr & MISTA_RDU)
    {
        emacdev->rx_stat.rdu++;
        if(!emacdev->configs.reg.bits.drxdesc)
            emac_ready(intf);
    }
    if(isr & MISTA_DEN)
        emacdev->rx_stat.den++;
    if(isr & MISTA_DFO)
        emacdev->rx_stat.dfo++;
    if(isr & MISTA_MMP)
        emacdev->rx_stat.mmp++;
    if(isr & MISTA_RP)
        emacdev->rx_stat.rp_r++;
    if(isr & MISTA_PTLE)
        emacdev->rx_stat.ptle_r++;
    if(isr & MISTA_RXOV)
        emacdev->rx_stat.rxov++;
    if(isr & MISTA_CRCE)
        emacdev->rx_stat.crce_r++;
    if(isr & MISTA_RXGD)
        rxdesc_handle(intf, desc_cur);
}

