yenchouRJ/nuc990_non-os/Library/StdDriver/src/emac.c
void emac0_tx_handler(void)
{
    enum EMACINTF intf = EMAC_INTF0;

    emac_tx_handler(intf);
}

void emac0_rx_handler(void)
{
    enum EMACINTF intf = EMAC_INTF0;

    emac_rx_handler(intf);
}

void emac1_tx_handler(void)
{
    enum EMACINTF intf = EMAC_INTF1;

    emac_tx_handler(intf);
}

void emac1_rx_handler(void)
{
    enum EMACINTF intf = EMAC_INTF1;

    emac_rx_handler(intf);
}

u16 mdio_read(enum EMACINTF intf, u8 addr, u8 reg)
{
    EMACdevice *emacdev = &EMACdev[intf];
    emacdev->Base->MIIDA = MIIDA_MDCON | MIIDA_BUSY | ((u32)addr << MIIDA_PHYAD_POS) | (u32)reg;
    while(emacdev->Base->MIIDA & MIIDA_BUSY);

    return (u16)emacdev->Base->MIID;
}

void mdio_write(enum EMACINTF intf, u8 addr, u8 reg, u16 val)
{
    EMACdevice *emacdev = &EMACdev[intf];
    emacdev->Base->MIID = val;
    emacdev->Base->MIIDA = MIIDA_MDCON | MIIDA_BUSY | MIIDA_WRITE | ((u32)addr << MIIDA_PHYAD_POS) | (u32)reg;
    while(emacdev->Base->MIIDA & MIIDA_BUSY);
}

void emac_suspend(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    // suspend tx/rx
    emacdev->Base->MCMDR &= ~(MCMDR_TXON | MCMDR_RXON);
}

void emac_resume(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    // resume tx/rx
    emacdev->Base->MCMDR |= (MCMDR_TXON | MCMDR_RXON);
    emacdev->Base->TSDR = 0;
    emacdev->Base->RSDR = 0;
}

static int reset_phy(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    u32 spd, dpx;
    int delay;
    u16 reg;

    emacdev->PhyBase = DEFAULT_PHY_BASE;
    spd = emacdev->configs.reg.bits.spd;
    dpx = emacdev->configs.reg.bits.dpx;

    emac_suspend(intf);

#if defined(FOR_EMULATION)
    if((spd == SPD_NEGOTIATE) || (dpx == DUPLEX_NEGOTIATE))
        goto PHY_ERR;
#endif

    if(spd && dpx)
    {
        if(spd == SPD_100M)
            emacdev->Base->MCMDR |= MCMDR_OPMOD;
        else
            emacdev->Base->MCMDR &= ~MCMDR_OPMOD;

        if(dpx == DUPLEX_FULL)
            emacdev->Base->MCMDR |= MCMDR_FDUP;
        else
            emacdev->Base->MCMDR &= ~MCMDR_FDUP;
    }
    else // auto negotiation
    {
        // reset PHY
        mdio_write(intf, emacdev->PhyBase, MII_BMCR, BMCR_RESET);

        delay = 2000;
        while(delay-- > 0)
        {
            if((mdio_read(intf, emacdev->PhyBase, MII_BMCR) & BMCR_RESET) == 0)
                break;
        }

        if(delay == 0)
        {
            printf("Reset PHY failed\n");
            goto PHY_ERR;
        }

        mdio_write(intf, emacdev->PhyBase, MII_ADVERTISE, ADVERTISE_CSMA |
                   ADVERTISE_10HALF |
                   ADVERTISE_10FULL |
                   ADVERTISE_100HALF |
                   ADVERTISE_100FULL);

        reg = mdio_read(intf, emacdev->PhyBase, MII_BMCR);
        // restart auto negotiation
        mdio_write(intf, emacdev->PhyBase, MII_BMCR, reg | BMCR_ANRESTART);

        delay = 200000;
        while(delay-- > 0)
        {
            if((mdio_read(intf, emacdev->PhyBase, MII_BMSR) & (BMSR_ANEGCOMPLETE | BMSR_LSTATUS)) == 
               (BMSR_ANEGCOMPLETE | BMSR_LSTATUS))
                break;
        }

        if(delay == 0)
        {
            printf("Auto negotiation failed. Set to 100 FULL\n");
            emacdev->Base->MCMDR |= MCMDR_OPMOD | MCMDR_FDUP;
            // goto PHY_ERR;
        }
        else
        {
            reg = mdio_read(intf, emacdev->PhyBase, MII_LPA);

            if(reg & ADVERTISE_10HALF)
                emacdev->Base->MCMDR |= ~MCMDR_OPMOD | ~MCMDR_FDUP;
            else if(reg & ADVERTISE_10FULL)
                emacdev->Base->MCMDR |= ~MCMDR_OPMOD | MCMDR_FDUP;
            else if(reg & ADVERTISE_100HALF)
                emacdev->Base->MCMDR |= MCMDR_OPMOD | ~MCMDR_FDUP;
            else // ADVERTISE_100FULL
                emacdev->Base->MCMDR |= MCMDR_OPMOD | MCMDR_FDUP;
        }
    }
    emac_resume(intf);

    return 0;

PHY_ERR:
    emac_resume(intf);
    return ERR_EMAC_EIO;
}

static void set_mac_addr(enum EMACINTF intf, u8 *addr, u8 id)
{
    EMACdevice *emacdev = &EMACdev[intf];

    if(id > 14)
        return;

    emacdev->Base->CAMxML[id][0] = (addr[0] << 24) | (addr[1] << 16) |
                                   (addr[2] << 8)  | addr[3];
    emacdev->Base->CAMxML[id][1] = (addr[4] << 24) | (addr[5] << 16);
#if !defined(FOR_EMULATION)
    // enable cmp
    if((emacdev->Base->CAMCMR & CAMCMR_ECMP) == 0)
        emacdev->Base->CAMCMR |= CAMCMR_ECMP;
#endif
    emacdev->Base->CAMEN |= 0x1 << id;
}

void set_control_frame(enum EMACINTF intf, u8 *da, u8 *sa, u16 opcode, u8 time)
{
    EMACdevice *emacdev = &EMACdev[intf];

    set_mac_addr(intf, da, 13);
    set_mac_addr(intf, sa, 14);

    emacdev->Base->CAMxML[15][0] = ((u32)ETHERTYPE_CF << CAM15M_LENTYPE_POS) | ((u32)opcode & CAM15M_OPCODE_MASK);
    emacdev->Base->CAMxML[15][1] = ((u32)time << CAM15L_OPERAND_POS) & CAM15L_OPERAND_MASK;
    emacdev->Base->CAMEN |= 0x1 << 15;
}

void send_pause_frame(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];

    emacdev->Base->MCMDR |= MCMDR_SDPZ | MCMDR_TXON;
    emacdev->Base->TSDR = 0;

    while(emacdev->Base->MCMDR & MCMDR_SDPZ);
}

/* hash function */
static u32 bitrev32(u32 value) {
    u32 result = 0;
    for (int i = 0; i < 32; i++) {
        result <<= 1;
        result |= (value & 1);
        value >>= 1;
    }
    return result;
}

#define ETH_POLYNOMIAL_LE 0xEDB88320
static u32 crc32_le(u32 crc, const u8 *data, size_t len) {
    //crc = ~crc;  // Initialize with all bits set to 1
    while (len--) {
        crc ^= *data++;
        for (int i = 0; i < 8; i++) {
            if (crc & 1)
                crc = (crc >> 1) ^ ETH_POLYNOMIAL_LE;
            else
                crc >>= 1;
        }
    }
    //return ~crc;  // Finalize by inverting all bits
    return crc;
}

#define HASH_TABLE_BITS_LOG2 6
// HW hash group calculation
// mcbitslog2 is 6 for 64 bits
static u32 hash_group_calc(u8 *addr, u32 *mc_filter, int mcbitslog2)
{
    u32 bit_nr;

    bit_nr = bitrev32(~crc32_le(~0, addr, ETH_ALEN)) >> (32 - mcbitslog2);
	mc_filter[bit_nr >> 5] |= 1 << (bit_nr & 31);

    return bit_nr;
}

/**
 * @brief Set hash filter for multicast or unicast address
 *
 * @param intf
 * @param addr
 * @return u32 bit in hash table
 */
u32 hash_add_filter(enum EMACINTF intf, u8 *addr)
{
    EMACdevice *emacdev = &EMACdev[intf];
    u32 *mc_filter = emacdev->hash_table;

    emacdev->hash_id = hash_group_calc(addr, mc_filter, HASH_TABLE_BITS_LOG2);
    emacdev->Base->HTMR = mc_filter[1];
    emacdev->Base->HTLR = mc_filter[0];

