yenchouRJ/nuc990_non-os/Library/StdDriver/src/emac.c
    return emacdev->hash_id;
}

int hash_mask_filter(enum EMACINTF intf, u32 hashid)
{
    EMACdevice *emacdev = &EMACdev[intf];
    u32 *mc_filter = emacdev->hash_table;

    if(hashid > 63)
        return -1;

    mc_filter[hashid >> 5] &= ~(1 << (hashid & 31));
    emacdev->Base->HTMR = mc_filter[1];
    emacdev->Base->HTLR = mc_filter[0];

    return 0;
}

void hash_clear_filter(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];

    memset(emacdev->hash_table, 0, sizeof(emacdev->hash_table));
    emacdev->Base->HTMR = 0;
    emacdev->Base->HTLR = 0;
}

/* ptp function */
static int ts_init(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    u64 addend;

    emac->TSCTL |= TSCTL_DEFAULT;

    // design tsinc to 10ns aka 100MHz, and addend is 2^32/(HCLK/100M) i.e. 2^32*100M/180M
    addend = ((u64)1 << 32) * (u64)EMAC_TS_ACCURACY_MHZ / (u64)EMAC_HCLK_MHZ(CLK_GetClockFreq(CLK_HCLK));
    emacdev->ts_addend = (u32)addend;

    emac->TSINC = 1000/EMAC_TS_ACCURACY_MHZ;
    emac->TSADDEND = emacdev->ts_addend;

    return 0;
}

int ts_set_timespec64(enum EMACINTF intf, struct timespec64 *ts)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    int limit;

    if(!emacdev->configs.reg.bits.ts)
        return ERR_EMAC_PERM;

    emac->TSUPDSEC = (u32)ts->tv_sec;
    emac->TSUPDSUBSEC = ts->tv_nsec;

    emac->TSCTL |= TSCTL_TSIEN;

    limit = 10;
	while (limit--) {
		if (!(emac->TSCTL & TSCTL_TSIEN))
			break;
		//mdelay(10);
	}

	// temp = emac->TSSUBSEC; // read subsec to update sec

    if (limit <= 0)
		return ERR_EMAC_EIO;

    return 0;
}

int ts_set_time(enum EMACINTF intf, u64 nsec)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    int limit;

    if(!emacdev->configs.reg.bits.ts)
        return ERR_EMAC_PERM;

    emac->TSUPDSEC = nsec / SEC_TO_NSEC;
    emac->TSUPDSUBSEC = nsec % SEC_TO_NSEC;

    emac->TSCTL |= TSCTL_TSIEN;

    limit = 10;
	while (limit--) {
		if (!(emac->TSCTL & TSCTL_TSIEN))
			break;
		//mdelay(10);
	}

	// temp = emac->TSSUBSEC; // read subsec to update sec

    if (limit <= 0)
		return ERR_EMAC_EIO;

    return 0;
}

void ts_adjust_time_addsub(enum EMACINTF intf, s64 delta)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    int limit;
    int sub = 0;

    if (delta < 0)
        sub = TSSSEC_ADDSUB_MASK;

    delta = llabs(delta);

    emac->TSUPDSEC = delta / SEC_TO_NSEC;
    emac->TSUPDSUBSEC = sub | (delta % SEC_TO_NSEC);
    emac->TSCTL |= TSCTL_TSUPDATE;

    limit = 10;
    while (limit--) {
		if (!(emac->TSCTL & TSCTL_TSIEN))
			break;
		//mdelay(10);
	}

	// temp = emac->TSSUBSEC; // read subsec to update sec
}

void ts_adjust_freq(enum EMACINTF intf, s32 ppb)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
	u32 diff, addend;
	int neg_adj = 0;
	u64 adj;

	if (ppb < 0) {
		neg_adj = 1;
		ppb = -ppb;
	}

	addend = emacdev->ts_addend;
	adj = addend;
	adj *= ppb;
	diff = adj / SEC_TO_NSEC;
	addend = neg_adj ? (addend - diff) : (addend + diff);
	
    emac->TSADDEND = addend;
}

void ts_get_timespec64(enum EMACINTF intf, struct timespec64 *ts)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;

    if(!ts || !emacdev->configs.reg.bits.ts)
        return;

    ts->tv_nsec = emac->TSSUBSEC & TSSUBSEC_MASK;
    ts->tv_sec = emac->TSSEC;
}

void ts_get_time(enum EMACINTF intf, u64 *nsec)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    u32 sec, subsec;

    if(!emacdev->configs.reg.bits.ts)
        return;

    subsec = emac->TSSUBSEC & TSSUBSEC_MASK;
    sec = emac->TSSEC;

    if(nsec)
        *nsec = (u64)sec * SEC_TO_NSEC + (u64)subsec;
}

void ts_set_alarm(enum EMACINTF intf, u64 nsec)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;

    emac->TSALMSEC = nsec / SEC_TO_NSEC;
    emac->TSALMSUBSEC = nsec % SEC_TO_NSEC;

    // enable alarm, it will alarm iff (TSALMSEC == TSSEC) && (TSALMSUBSEC == TSSUBSEC)
    emac->MIEN |= MIEN_TSALMIEN;
    emac->TSCTL |= TSCTL_TSALMEN;
}

void ts_delay_alarm(enum EMACINTF intf, u64 nsec)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    u64 curr;

    curr = (u64)emac->TSSUBSEC + (u64)emac->TSSEC * SEC_TO_NSEC;
    nsec += curr;
    emac->TSALMSEC = nsec / SEC_TO_NSEC;
    emac->TSALMSUBSEC = nsec % SEC_TO_NSEC;

    // enable alarm, it will alarm iff (TSALMSEC == TSSEC) && (TSALMSUBSEC == TSSUBSEC)
    emac->MIEN |= MIEN_TSALMIEN;
    emac->TSCTL |= TSCTL_TSALMEN;
}

int ts_check_alarm(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];

    if(emacdev->ts_alarm_flag)
    {
        emacdev->ts_alarm_flag = 0;
        return 0;
    }
    else
        return 1;
}

/*  Once emac and ts are ready, this can be used as timer delay */
void ts_delay_poll(enum EMACINTF intf, u64 nsdelay)
{
    ts_delay_alarm(intf, nsdelay);
    while(ts_check_alarm(intf));
}

/* This function aligns pulse to SEC */
int pps_cmd_set(enum EMACINTF intf, enum PPSCMD cmd)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;

    if(!emacdev->perout_enable && cmd > PPSCMD_NO_CMD)
        return -1;

    emac->PPSCTL = cmd & PPSCTL_MASK;

    return 0;
}

/**
 * @brief setting period output pulse
 * start/stop = 0 means immediatelly start/stop
 * period = 0 means disable period output
 *
 * @param intf interface
 * @param req structure contains start, stop, period, type
 * @return int 0 if success, else if fail
 */
int pps_perout_cmd_set(enum EMACINTF intf, struct perout_request *req)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    u32 ticks, hi, lo;
    u64 sec, nsec;
    u32 cmd;
    uint32_t hclk_freq = CLK_GetClockFreq(CLK_HCLK);

    if (req->period == 0) {
        pps_cmd_set(intf, PPSCMD_NO_CMD);
        return 0;
    } else if (req->period > hclk_freq / 2) {
        return -1;
    }

