yenchouRJ/nuc990_non-os/Library/StdDriver/src/emac.c
    switch (req->type) {
    case PEROUT_START_SINGLE_AT:
        // single pulse do not support immediate start
        if (req->start == 0)
            return -1;
    case PEROUT_START_SEQ_AT:
        // make it close to 50% duty cycle
        ticks = hclk_freq / req->period;
        hi = ticks / 2;
        lo = ticks - hi;
        emac->PPSHW = hi - 1;
        emac->PPSLW = lo - 1;
        if (req->start == 0) {
            cmd = PPSCMD_START_SEQ;
        } else {
            sec = req->start / SEC_TO_NSEC;
            nsec = req->start % SEC_TO_NSEC;
            emac->PPSTSEC = sec;
            emac->PPSTSSEC = nsec;
            cmd = req->type == PEROUT_START_SINGLE_AT ?
                PPSCMD_START_SINGLE_AT_TIME : PPSCMD_START_SEQ_AT_TIME;
        }
        break;
    case PEROUT_STOP_AT:
        if (req->stop == 0) { // stop immediately
            cmd = PPSCMD_NO_CMD;
        } else {
            sec = req->stop / SEC_TO_NSEC;
            nsec = req->stop % SEC_TO_NSEC;
            emac->PPSTSEC = sec;
            emac->PPSTSSEC = nsec;
            cmd = PPSCMD_STOP_SEQ_AT_TIME;
        }
        break;
    default:
        break;
    }

    emacdev->perout_enable = 1;
    pps_cmd_set(intf, (enum PPSCMD)cmd);
    emacdev->perout_enable = 0;

    return 0;
}

/* mtu only refers to payload */
int change_mtu(enum EMACINTF intf, u16 mtu)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    
    if(mtu > MAX_MTU)
        return -1;

    emac_suspend(intf);

    if(mtu > MTU_UPPER)
    {
        emacdev->configs.reg.bits.alp = 1;
        emac->MCMDR |= MCMDR_ALP;
    }
    else if(mtu < MTU_LOWER)
    {
        emacdev->configs.reg.bits.arp = 1;
        emac->MCMDR |= MCMDR_ARP;
    }

    emac->DMARFC = (mtu + ETHERNET_HEADER + ETHERNET_CRC) & DMARFC_RXMS_MASK; // maximum packet length

    emac_resume(intf);

    return 0;
}

static int emac_init(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    EMAC_T *emac = emacdev->Base;
    int delay;
    int ret;

    // Reset EMAC
    emac->MCMDR |= MCMDR_SWR;
    while(emac->MCMDR & MCMDR_SWR);
    delay = 100;
    while(delay-- > 0)
    {
        if(!(emac->MCMDR & MCMDR_SWR))
            break;
    }
    if(delay == 0)
    {
        printf("Fatal: Reset EMAC%d failed\n", (u32)intf);
        return ERR_EMAC_EIO;
    }

    init_tx_desc_ring(intf);
    init_rx_desc_ring(intf);

    emac->CAMCMR = CAMCMR_ABP;
    emac->MCMDR = MCMDR_DEFAULT;
    //emac->FFTCR = BURSTLEN_8WORD;
    emac->MIEN = MIEN_DEFAULT;

    if(intf == EMAC_INTF0)
    {
        set_mac_addr(intf, mac_addr0, 0);
        sysInstallISR(IRQ_LEVEL_1, EMAC0_TX_IRQn, (PVOID)emac0_tx_handler);
        sysInstallISR(IRQ_LEVEL_1, EMAC0_RX_IRQn, (PVOID)emac0_rx_handler);
        if(!emacdev->configs.reg.bits.dint)
        {
            sysEnableInterrupt(EMAC0_TX_IRQn);
            sysEnableInterrupt(EMAC0_RX_IRQn);
        }
    }
    else
    {
        set_mac_addr(intf, mac_addr1, 0);
        sysInstallISR(IRQ_LEVEL_1, EMAC1_TX_IRQn, (PVOID)emac1_tx_handler);
        sysInstallISR(IRQ_LEVEL_1, EMAC1_RX_IRQn, (PVOID)emac1_rx_handler);
        if(!emacdev->configs.reg.bits.dint)
        {
            sysEnableInterrupt(EMAC1_TX_IRQn);
            sysEnableInterrupt(EMAC1_RX_IRQn);
        }
    }

    ts_init(intf);

    if(emacdev->configs.reg.bits.bcst)
        emac->CAMCMR |= CAMCMR_ABP;
    if(emacdev->configs.reg.bits.mcst)
        emac->CAMCMR |= CAMCMR_AMP;
    if(emacdev->configs.reg.bits.ucst) // higher priority than ecmp
        emac->CAMCMR |= CAMCMR_AUP;
    if(emacdev->configs.reg.bits.ahmp)
    {
        emac->CAMCMR &= ~CAMCMR_AMP;
        emac->CAMCMR |= CAMCMR_AHMP;
    }
    if(emacdev->configs.reg.bits.ahup)
    {
        emac->CAMCMR &= ~CAMCMR_AUP;
        emac->CAMCMR |= CAMCMR_AHUP;
    }
    if(emacdev->configs.reg.bits.ecmp)
        emac->CAMCMR |= CAMCMR_ECMP;
    if(emacdev->configs.reg.bits.ccam)
    {
        emac->CAMCMR &= ~(CAMCMR_AHMP | CAMCMR_AHUP);
        emac->CAMCMR |= CAMCMR_CCAM;
    }
    if(emacdev->configs.reg.bits.coe)
        emac->MCMDR |= MCMDR_RTIOEN;
    if(emacdev->configs.reg.bits.dspcrc)
        emac->MCMDR &= ~MCMDR_SPCRC;
    if(emacdev->configs.reg.bits.aep)
        emac->MCMDR |= MCMDR_AEP;
    if(emacdev->configs.reg.bits.arp)
    {
        emac->MCMDR |= MCMDR_ARP;
        emac->MIEN |= MIEN_RPIEN;
    }
    if(emacdev->configs.reg.bits.alp)
    {
        emac->MCMDR |= MCMDR_ALP;
        emac->MIEN |= MIEN_LPIEN;
    }
#if defined(FOR_EMULATION) || defined(FOR_SIMULATION) || defined(FOR_REAL_CHIP)
    if(emacdev->configs.reg.bits.lpb)
        emac->MCMDR |= MCMDR_LPB;
#endif
    if(emacdev->configs.reg.bits.ts)
    {
        emac->TSCTL |= TSCTL_TSEN | TSCTL_TSSNPEN;
        if(!emacdev->configs.reg.bits.coe)
        {
            emacdev->configs.reg.bits.coe = 1;
            emac->MCMDR |= MCMDR_RTIOEN;
        }
    }
    if(emacdev->configs.reg.bits.tsall)
        emac->TSCTL |= TSCTL_TSSNAEN;
    if(emacdev->configs.reg.bits.wol)
    {
        emac->MCMDR |= MCMDR_MGP_WAKE;
        emac->MIEN |= MIEN_WOLIEN;
        emacdev->wol_flag = 0;
    }

    ret = reset_phy(intf);
    if(ret)
        return ret;

    // ready for rx
    emac_ready(intf);

    return 0;
}

int emac_open(enum EMACINTF intf, EMACconfig config)
{
    EMACdevice *emacdev = &EMACdev[intf];
    int ret;

    memset((void *)emacdev, 0, sizeof(EMACdevice));

    if(intf == EMAC_INTF0) {
        CLK->HCLKEN0 |= CLK_HCLKEN0_EMAC0EN_Msk;
        CLK->DIVCTL8 = (CLK->DIVCTL8 & ~0xFF) | 0xA0; // MDC 1.125MHz
        SYS->GPE_MFPL = (SYS->GPE_MFPL & ~0xFFFFFFFF) | 0x11111111;
        SYS->GPE_MFPH = (SYS->GPE_MFPH & ~0xFF) | 0x11;
        if (config.reg.bits.pps)
            SYS->GPF_MFPH = (SYS->GPF_MFPH & ~0xF00) | 0x100;
        emacdev->Base = EMAC0;
        emacdev->Intf = EMAC_INTF0;
    } else {
        CLK->HCLKEN0 |= CLK_HCLKEN0_EMAC1EN_Msk;
        CLK->DIVCTL8 = (CLK->DIVCTL8 & ~0xFF) | 0xA0; // MDC 1.125MHz
        SYS->GPF_MFPL = (SYS->GPF_MFPL & ~0xFFFFFFFF) | 0x11111111;
        SYS->GPF_MFPH = (SYS->GPF_MFPH & ~0xFF) | 0x11;
        if (config.reg.bits.pps)
            SYS->GPB_MFPL = (SYS->GPB_MFPL & ~0xF00000) | 0x100000;
        emacdev->Base = EMAC1;
        emacdev->Intf = EMAC_INTF1;
    }

    emacdev->configs = config;
    
    ret = emac_init(intf);
    if(ret)
    {
        printf("EMAC%d init failed\n", (u32)intf);
        return ret;
    }

    return 0;
}

/* This make emac fetch rxdesc */
void emac_ready(enum EMACINTF intf)
{
    EMACdevice *emacdev = &EMACdev[intf];
    // ready for rx
    emacdev->Base->RSDR = 0;
}
